testing_cases/officeMVLiu2022_PSPM/0/epsilon
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2106                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      epsilon;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -3 0 0 0 0];

internalField   uniform 1e-06;

boundaryField
{
    DV_inlet
    {
        type            epsilonWallFunction;
        value           uniform 1e-06;
    }
    
    "MV_inlet_.*"
    {
        //type            turbulentMixingLengthDissipationRateInlet;
        //mixingLength    0.01;
        //value           $internalField;  
        type         fixedValue;
        value        uniform 2.10;   
    }
    emitter_inlet
    {
        type		fixedValue;
	value		uniform 7.76e-4;
    }
    "(chair_.*|computer_.*|fluorescent_.*|manikin_.*|monitor_.*|TV|wall_.*)"
    {
        type            epsilonWallFunction;
        value           uniform 1e-06;
    }

    outlet
    {
        type            inletOutlet;
        phi             phi;
        inletValue      $internalField;
        value           $internalField;
    }
}


// ************************************************************************* //
