testing_cases/officeMVLiu2022_PSPM/0/k
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2106                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 1e-6;

boundaryField
{
    DV_inlet
    {
        type            kqRWallFunction;
        value           uniform 1e-6;
    }
    
    "MV_inlet_.*"
    {
        //type        turbulentIntensityKineticEnergyInlet;
        //intensity   0.15;
        //value       $internalField; 
        type         fixedValue;
        value        uniform 2.53e-1;   
    }
    emitter_inlet
    {
        type		fixedValue;
        value          uniform 2.43e-4;
    }

    "(chair_.*|computer_.*|fluorescent_.*|manikin_.*|monitor_.*|TV|wall_.*)"
    {
        type            kqRWallFunction;
        value           uniform 1e-6;
    }

    outlet
    {
        type            inletOutlet;
        phi             phi;
        inletValue      $internalField;
        value           $internalField;
    }
}


// ************************************************************************* //
