testing_cases/officeMVLiu2022_PSPM/system/fvSolution1
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2106                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    p_rgh
    {
        solver           GAMG;
        tolerance        1e-8;
        relTol           0.01;
        smoother         GaussSeidel;
        cacheAgglomeration true;
        nCellsInCoarsestLevel 10;
        agglomerator     faceAreaPair;
        mergeLevels      1;
    }

    "(U|h|k|epsilon)"
    {
        solver           PBiCGStab;
        preconditioner   DILU;
        tolerance        1e-7;
        relTol           0.05;
    }
    
    C
    {
        solver           PBiCG;
        preconditioner   diagonal;
        tolerance        1e-8;
        relTol           0.1;
    }
}

SIMPLE
{
    momentumPredictor yes;
    nNonOrthogonalCorrectors 0;
    
    pRefCell        0;
    pRefValue       0;
    
    Sc              0.7;

    residualControl
    {
        p_rgh           1e-4;
        U               1e-4;
        h               1e-4;

        // possibly check turbulence fields
        "(k|epsilon|omega|C)" 1e-3;
    }
}

relaxationFactors
{
/*
    fields
    {
        rho             1;
        p_rgh           0.7;
    }
    equations
    {
        U               0.01;
        h               0.3;
    }
*/
    fields
    {
        rho             0.1;
        p_rgh           0.1;
    }
    equations
    {
        U               0.01;
        h               0.01;
        //"(k|epsilon|omega)" 0.7;
        "(k|epsilon|omega|C)" 0.01;
    }
}


// ************************************************************************* //
