testing_cases/officeMVLiu2022_PSPM/system/sample
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version         2.0;
    format          ascii;
    class           dictionary;
    location        "system";
    object          sample;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

type sets;
libs            ("libsampling.so");

interpolationScheme cellPointFace;

setFormat csv;

sets
(
    loc_1
    {
        type            face;
        axis            xyz;
        start   (0.3 2.75 -0.1);
        end     (0.3 2.75 3.6);
    }
    loc_2
    {
        type            face;
        axis            xyz;
        start   (0.3 2.9 -0.1);
        end     (0.3 2.9 3.6);
    }
    loc_3
    {
        type            face;
        axis            xyz;
        start   (0.3 3.05 -0.1);
        end     (0.3 3.05 3.6);
    }
    /*
    loc_4
    {
        type            face;
        axis            xyz;
        start   (2.35 1.9 -0.1);
        end     (2.35 1.9 3.6);
    }
    */
    loc_5
    {
        type            face;
        axis            xyz;
        start   (3.5 4.8 -0.1);
        end     (3.5 4.8 3.6);
    }
    loc_6
    {
        type            face;
        axis            xyz;
        start   (1.0 2.9 -0.1);
        end     (1.0 2.9 3.6);
    }
    loc_7
    {
        type            face;
        axis            xyz;
        start   (3.5 1.0 -0.1);
        end     (3.5 1.0 3.6);
    }
    loc_8
    {
        type            face;
        axis            xyz;
        start   (6.0 2.9 -0.1);
        end     (6.0 2.9 3.6);
    }
);

fields
(
    U
    T
    C
);


// ************************************************************************* //
