testing_cases/officeMVLiu2022_PSPM/system/stl_names.txt
chair_1.stl
chair_2.stl
chair_3.stl
chair_4.stl

DV_inlet.stl

fluorescent_1.stl
fluorescent_2.stl
fluorescent_3.stl
fluorescent_4.stl
fluorescent_5.stl

fluorescent_6.stl
fluorescent_7.stl
fluorescent_8.stl
fluorescent_9.stl
fluorescent_10.stl

manikin_1.stl
manikin_2.stl
manikin_3.stl
manikin_4.stl

outlet.stl

TV.stl

wall_back.stl
wall_bottom.stl
wall_closet.stl
wall_DV.stl
wall_DV_tube.stl

wall_front.stl
wall_left.stl
wall_right.stl
wall_table.stl
wall_top.stl
