testing_cases/officeMVLiu2022_PSPM/system/stl_names_nostl.txt
{file "chair_1.eMesh"; 	        level 1;}
{file "chair_2.eMesh"; 	        level 1;}
{file "chair_3.eMesh"; 	        level 1;}
{file "chair_4.eMesh"; 	        level 1;}

{file "DV_inlet.eMesh"; 	    level 1;}

{file "fluorescent_1.eMesh"; 	level 1;}
{file "fluorescent_2.eMesh"; 	level 1;}
{file "fluorescent_3.eMesh"; 	level 1;}
{file "fluorescent_4.eMesh"; 	level 1;}
{file "fluorescent_5.eMesh"; 	level 1;}

{file "fluorescent_6.eMesh"; 	level 1;}
{file "fluorescent_7.eMesh"; 	level 1;}
{file "fluorescent_8.eMesh"; 	level 1;}
{file "fluorescent_9.eMesh"; 	level 1;}
{file "fluorescent_10.eMesh"; 	level 1;}

{file "manikin_1.eMesh"; 	    level 1;}
{file "manikin_2.eMesh"; 	    level 1;}
{file "manikin_3.eMesh"; 	    level 1;}
{file "manikin_4.eMesh"; 	    level 1;}

{file "outlet.eMesh"; 	        level 1;}

{file "TV.eMesh"; 	            level 1;}

{file "wall_back.eMesh"; 	    level 1;}
{file "wall_bottom.eMesh"; 	    level 1;}
{file "wall_closet.eMesh"; 	    level 1;}
{file "wall_DV.eMesh"; 	        level 1;}
{file "wall_DV_tube.eMesh"; 	level 1;}

{file "wall_front.eMesh"; 	    level 1;}
{file "wall_left.eMesh"; 	    level 1;}
{file "wall_right.eMesh"; 	    level 1;}
{file "wall_table.eMesh"; 	    level 1;}
{file "wall_top.eMesh"; 	    level 1;}
